tiborsimon/embedded-tdd-headers/pic/8bit/pic18f2610_tdd.h
#define HLVDL3                        522
#define LVV3                          523
#define LVDL3                         524
#define HLVDEN                        525
#define LVDEN                         526
#define BGST                          527
#define IRVST                         528
#define IVRST                         529
#define VDIRMAG                       530
#define OSCCON                        531
#define SCS0                          532
#define SCS                           533
#define SCS1                          534
#define FLTS                          535
#define IOFS                          536
#define OSTS                          537
#define IRCF                          538
#define IRCF0                         539
#define IRCF1                         540
#define IRCF2                         541
#define IDLEN                         542
#define T0CON                         543
#define T0PS                          544
#define T0PS0                         545
#define T0PS1                         546
#define T0PS2                         547
#define PSA                           548
#define T0PS3                         549
#define T0SE                          550
#define T0CS                          551
#define T08BIT                        552
#define T016BIT                       553
#define TMR0ON                        554
#define STATUS                        555
#define C                             556
#define CARRY                         557
#define DC                            558
#define ZERO                          559
#define Z                             560
#define OV                            561
#define OVERFLOW                      562
#define N                             563
#define NEGATIVE                      564
#define INTCON3                       565
#define INT1IF                        566
#define INT1F                         567
#define INT2IF                        568
#define INT2F                         569
#define INT1E                         570
#define INT1IE                        571
#define INT2IE                        572
#define INT2E                         573
#define INT1P                         574
#define INT1IP                        575
#define INT2IP                        576
#define INT2P                         577
#define INTCON2                       578
#define RBIP                          579
#define TMR0IP                        580
#define INTEDG2                       581
#define INTEDG1                       582
#define INTEDG0                       583
#define RBPU                          584
#define NOT_RBPU                      585
#define nRBPU                         586
#define INTCON                        587
#define RBIF                          588
#define INT0F                         589
#define INT0IF                        590
#define T0IF                          591
#define TMR0IF                        592
#define RBIE                          593
#define INT0E                         594
#define INT0IE                        595
#define T0IE                          596
#define TMR0IE                        597
#define PEIE                          598
#define PEIE_GIEL                     599
#define GIEL                          600
#define GIE_GIEH                      601
#define GIE                           602
#define GIEH                          603
#define SP0                           604
#define STKPTR                        605
#define SP1                           606
#define SP2                           607
#define SP3                           608
#define SP4                           609
#define STKUNF                        610
#define STKOVF                        611
#define STKFUL                        612

#endif // _PIC18F2610_H_
